Tekla Open API Reference for Tekla Structures 2025
ControlLine.ControlLineColorEnum Enumeration
 The different line colors.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum ControlLineColorEnum
Public Enumeration ControlLineColorEnum
Members
Member name | Value | Description
YELLOW_RED | -1 |  The yellow/red color.
BLACK | 0 |  The black color.
WHITE | 1 |  The white color.
RED | 2 |  The red color.
GREEN | 3 |  The green color.
BLUE | 4 |  The blue color.
CYAN | 5 |  The cyan color.
YELLOW | 6 |  The yellow color.
MAGENTA | 7 |  The magenta color.
See Also
Reference
Tekla.Structures.Model Namespace